package java0917;

public class 복습1 {

	// 상수의 데이터 타입은 변하지 않는 값을 지정하는것이다.
	
	public static void main(String[] args) {
		
		int a = 1; //이 코드에서 int는 데이터 타입이고 a는 선언된 변수 1은 상수이다.
//		1 = 3;	// 이는 변할수 없는 상수이기에 성립되지 않는식이다.
		
//		int b = 2.2; // 여기서 2.2는 정수가 아닌 실수 이기때문에 정수값만을 받는 int형 변수에는 대입할수 없다.
		double c = 2.2; // 이처럼 소수점 이하로 확장되는 수들은 float이나 double을 사용해야한다.
						// 단 float보다 double이 더 큰 범위를 포함하므로, 대부분 실수를 사용할 땐 double타입을 사용한다.
		
		//형변환
		
		int d = 50000;
		long e = d;     // long은 int보다 더 큰 범위의 타입으로 int값을 long으로 대입했을대 자동적으로(묵시적)형번환이 일어난다.
		
		long f = 50000;
		int g = (int) f;     // 이처럼 범위가 더 큰 타입을 더 작은 타입으로 대입시킬때는 괄호안에 변환하고자 하는 타입을 지정해줘야한다.
		
		
		
	}

}
