package java1006;

public class 변수복습 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
/*        변수
		
		변수의 정의는 '변할수 있는 수' 이다.
		
		변수의 선언 = 변수에 해당하는 '데이터타입'에 '이름'(식별자)을 부여하는 작업
		변수의 식별자는 기본적으로 소문자이지만, 두개의 단어를 합쳐서 사용할땐 두번째 단어의 첫글자는 대문자 여야한다.

		변수의 초기화 = 선언된 변수에 숫자(리터럴)를 담는 작업. 변수는 여러번 초기화 할수 있다.
		
		숫자들을 담을 수 있는 데이터 타입
		
		int - 정수값을 담을수 있는 데이터 타입
		double - 실수 값을 담을 수 있는 데이터 타입( ex 1.12, 3.141592...)
		
		ex)
		
		* int count = 0;
		
		위의 식에서 int는 데이터타입, count는 식별자, = 는 대입연산자, 0은 정수로
		'count라는 식별자로 선언된 인트형변수에 0을 초기화 했다' 라는 뜻이다.
		
		ex)

		* int count = 1;
		* int count = 2;
		
		컴퓨터의 실행 순서는 위에서 아래로 좌에서 우순으로 실행되며,
		몇번 초기화 되었던 상관없이 가장 마지막에 초기화 된 숫자만 변수에 저장된다.
		(0과 1은 사라지고 2만 남게된다. 즉 'count = 2'가 성립되는것.)
		
*/		
		
	}

}
