package java1006;

public class 형변환복습 {

	public static void main(String[] args) {

/*		
		
		기본형 타입의 형변환
		
		* 형변환이란, 변수 또는 리터럴의 타입을 다른 타입으로 변환하는 것이다.
		  여기에는 2가지 형변환이 있다.
		  
		------------------------------------
		
		1. 자동 형변환(묵시적형변환 or 암묵적형변)
		   
		   크기가 작은 타입을 더 큰 타입으로 바꿀때에는 자동(묵시적)으로 형변환을 해준다. (별도의 작업 필요x)
		   
		   ex) int x = 50000;
		   	   long y = x;
		
		2. 수동 형변환(명시적 형변환)
		
		   자동 형변환과는 반대로 크기가 큰 타입에서 작은 타입으로 바꿀 때에는 별도의 작업을 통해 명시적으로 변환 해주어야 한다.
		   
		   ex) long x = 50000;
		   	   int y = (int) x;  / 반드시 (타입) 으로 명시적으로 형을 바꾸어 주어야 한다.
		   	   
		------------------------------------
		   	   
		타입 크기 및 범위의 순서
		
		byte < short,char < int < long < float < double
		(정수보단 실수가 더 큰 범위로 인식함. 소수점까지 표기해야하므로..)
		
*/
		
		
	}

}
